Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/nasjonalmuseet.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Albert Jærn (Historical event, person, place, with affiliation)
nb: Albert Jærn (Historisk hendelse, person, sted, med tilknytning)

source: "Riss av grunnplan" relates to: Related works
nb: "Riss av grunnplan" relaterer til: Utforsk lignende verk fra samlingen

source: Anish Kapoor was born in Mumbai, India, but moved to London to study art.
nb: Anish Kapoor ble født i Mumbai i India, men flyttet til London for å studere kunst.

source: Veuve Perrin (Manufactured by - uncertain)
nb: Veuve Perrin (Produsent - usikker)

source: Furu trained at the Academy of Fine Arts in Oslo.
nb: Furu er utdannet ved Statens Kunstakademi i Oslo.

source: "Seilbåt" relates to:
nb: "Seilbåt" relaterer til:

source: "Draperi på kiste" relates to: Related works
nb: "Draperi på kiste" relaterer til: Utforsk lignende verk fra samlingen

source: "Mannshode med lue" relates to: Related works
nb: "Mannshode med lue" relaterer til: Utforsk lignende verk fra samlingen

source: The Poet and Priest Petter Dass
nb: Dikteren og presten Petter Dass

source: Egedius created the painting in Bø in Telemark in the summer of 1896, with his fellow painter Torleiv Stadskleiv posing as the fiddler.
nb: Bildet er malt i Bø i Telemark sommeren 1896, med malerkollega Torleiv Stadskleiv som modell for felespilleren.

source: Born 1830 in Voss, death 1898 in Kristiania, Oslo
nb: Født 1830 i Voss, død 1898 i Kristiania, Oslo

source: "Fiskere og seilbåter, Göhren" relates to: Related works
nb: "Fiskere og seilbåter, Göhren" relaterer til: Utforsk lignende verk fra samlingen

source: For many people, Theodor Kittelsen’s portrayal of the Ash Lad who sees Soria Moria Palace in the distance has become a symbol of both hope for the future and the dream of succeeding in life.
nb: Theodor Kittelsens framstilling av Askeladden som ser Soria Moria i det fjerne har for mange blitt et symbol på framtidshåp og drømmen om å lykkes i livet.

source: "Utsikt over Falkenstein" relates to: Related works
nb: "Utsikt over Falkenstein, Falkensteen" relaterer til: Utforsk lignende verk fra samlingen

source: We find various types of reconstructions, miniaturizations, magnifications, plays on words, redefinitions, and amalgamations.
nb: Vi finner ulike former for ombygginger, forminskninger, forstørrelser, ordspill, redefineringer og sammensetninger.

source: It was in these metropolises, around 1860, that this East-Asian culture first had an impact.
nb: Det var i disse metropolene at innflytelsen først gjorde seg gjeldende, rundt 1860.

source: We see the family’s eldest members, Ane and Niels Gaihede, slicing bread, mending fishing nets or resting.
nb: Vi møter familiens eldste, Ane og Niels Gaihede, i det de skjærer brød, bøter fiskegarn eller tar seg en hvil.

source: "Stenen fra Påskeøyene" relates to: Related works
nb: "Stenen fra Påskeøyene" relaterer til: Utforsk lignende verk fra samlingen

source: "Pottemakerverksted" relates to:
nb: "Pottemakerverksted" relaterer til:

source: Has held exhibitions, carried out decorating commissions and received distinctions including the Arts Council Norway Honorary Award and the Royal Norwegian Order of St Olav (2018)
nb: • Tildelt en rekke utmerkelser, utstillings- og utsmykkingsoppdrag, blant annet Kulturrådets ærespris og St. Olavs Orden i 2018

source: Apart from the family, we know little about who Berger met in Norway, but she later became friends at the Bauhaus school with the Norwegian architect Ola Mørk Sandvik and the Italian architect Ivo Pannaggi, who settled in Norway in 1943.
nb: Bortsett fra familien vet vi lite om hvem Berger traff i Norge, men hun ble senere på Bauhausskolen venn med den norske arkitekten Ola Mørk Sandvik og den italienske arkitekten Ivo Pannaggi, som i 1943 bosatte seg i Norge.

source: Exhibition catalogue, Trondheim: Trondheim kunstmuseum, 2001.
nb: Utstillingskatalog, Trondheim: Trondheim kunstmuseum, 2001.

source: "Mannsfigurer med lasso" relates to: Related works
nb: "Mannsfigurer med lasso" relaterer til: Utforsk lignende verk fra samlingen

source: "Vilhelm Birkedal" relates to:
nb: "Vilhelm Birkedal" relaterer til:

source: Hans Heyerdahl grew up in Drammen and received his initial training as a painter in 1873 at the Christiania School of Drawing.
nb: Hans Heyerdahl vokste opp i Drammen og fikk sin første maleundervisning i 1873 ved Den Kongelige Tegneskole i Christiania.

source: This building, designed by Erling Viksjø and completed in 1969, was demolished in 2020 despite strong protests.
nb: Y-blokka, som ble tegnet av Erling Viksjø og stod ferdig i 1969, ble revet i 2020, til tross for sterke protester.

source: The surfaces are unpolished and seem unfinished.
nb: Overflatene er upolerte og virker uferdige.

source: "Trestudie ved Laacher See" relates to: Related works
nb: "Trestudie ved Laacher See" relaterer til: Utforsk lignende verk fra samlingen

source: Andreas Attemstett (assumed certain)
nb: Andreas Attemstett (antatt sikker)

source: Was concerned with the principle of "art for everyone" and "Neue Sachlichkeit" (new objectivity), rationality, simplicity and functionalism.
nb: Var opptatt av prinsippet om «kunst for alle» og «Neue Sachlichkeit», («ny saklighet»), rasjonalitet, enkelhet og funksjonalisme.

source: "Hest med sadel" relates to: Related works
nb: "Hest med sadel" relaterer til: Utforsk lignende verk fra samlingen

source: became Tidemand’s breakthrough painting in 1848.
nb: Haugianerne ble i 1848 Tidemands gjennombruddsmaleri.

source: "Klinkenberg ved Elstad (detalj)" relates to: Related works
nb: "Klinkenberg ved Elstad (detalj), Klinkenberget ved Elstad" relaterer til: Utforsk lignende verk fra samlingen

source: Photo: National Library of Norway / Anders Beer Wilse
nb: Nasjonalbiblioteket / Anders Beer Wilse

source: Jan Janssonius (Artist for cartoon/modello i.a.
nb: Jan Janssonius (Kunstner for mønster/kartong e.l.

source: Grey is the predominant colour, with touches of orange, blue, and white.
nb: Gråfargen dominerer, med innslag av oransje, blått og hvitt.

source: Per Krohg spent many of his formative years in Paris with his artist parents, Oda and Christian Krohg.
nb: Per Krohg tilbrakte mye av oppveksten i Paris med sine kunstnerforeldre Oda og Christian Krohg.

source: "Landskapsriss, Lledr Valley" relates to: Related works
nb: "Landskapsriss, Lledr Valley" relaterer til: Utforsk lignende verk fra samlingen

source: A competition for all three buildings was announced in 1864.
nb: En samlet konkurranse for alle tre bygningene ble utlyst i 1864.

source: The royal family was introduced to skiing by polar explorer Fridtjof Nansen and his wife Eva.
nb: Det gikk ikke lang tid før kongefamilien fikk innføring i skikjøring av Fridtjof Nansen og konen Eva.

source: , between 1910 and 1914.
nb: mellom 1910 og 1914.

source: Arthus-Bertrand (Publisher - assumed certain)
nb: Arthus-Bertrand (Utgiver/forlegger - antatt sikker)

source: Joseph Heinz (Artist for cartoon/modello i.a.
nb: Joseph Heinz (Kunstner for mønster/kartong e.l.

source: Until then Our Saviour’s Church (now Oslo Cathedral) had been the city’s only church, but it had become too small for the growing congregation.
nb: Til da var Vår Frelsers kirke (nå Oslo domkirke) byens eneste, men den ble for liten for den voksende menigheten.

source: The Virgin and the Unicorn
nb: Jomfruen og enhjørningen

source: Ness works on complex installations, usually with drawing as the predominant medium and video as an auxiliary element.
nb: Ness arbeider med komplekse installasjoner, hvor tegning er et hoveduttrykk og video er et av elementene.

source: Most art historians place it in the 1608-1612 period, with one exception dating it after Artemisia’s version.
nb: De fleste kunsthistorikere tidfester det til i perioden 1608–1612, med ett unntak, som daterer det til etter Artemisias versjon.

source: The encounter with the workshops the Masi Group had left behind over 35 years previously made a deep impression.
nb: Møtet med lokalene Masi-gruppa hadde forlatt mer enn 35 år tidligere ble sterkt.

source: "Uroer og fantasifigur" relates to: Related works
nb: "Uroer og fantasifigur" relaterer til: Utforsk lignende verk fra samlingen

source: Pierre Drevet (assumed certain)
nb: Pierre Drevet (antatt sikker)

source: He spent a great deal of time in Oslo from the age of 18 onwards.
nb: Fra han er rundt 18 år gammel holder han mye til i Oslo.

source: Salvator Rosa (by erroneus tradition)
nb: Salvator Rosa (ifølge feilaktig tradisjon)

source: (Soria Moria Palace), has become a symbol of the dream of succeeding in life.
nb: , er nærmest blitt et symbol på drømmen om å lykkes i livet.

source: "Kinateater i New York" relates to: Related works
nb: "Kinateater i New York" relaterer til: Utforsk lignende verk fra samlingen

source: Choson-dynastiet (Historical event, person, place, with affiliation)
nb: Choson-dynastiet (Historisk hendelse, person, sted, med tilknytning)

source: "Vannfall i Liselund" relates to: Related works
nb: "Vannfall i Liselund" relaterer til: Utforsk lignende verk fra samlingen

source: During his first trip to Telemark in 1892, Egedius had been captivated by its nature and culture and in particular the inherent “ferocity” of the region’s heritage of music and dance.
nb: På sin første tur i disse traktene, som var i 1892, ble Egedius fengslet av Telemarks natur og kultur, og ikke minst av ”villskapen” som lå i områd- ets musikk- og dansetradisjoner.

source: Ugo da Carpi (by erroneus tradition)
nb: Ugo da Carpi (ifølge feilaktig tradisjon)

source: "Gudstjeneste i Sauland kirke" relates to: Related works
nb: "Gudstjeneste i Sauland kirke" relaterer til: Utforsk lignende verk fra samlingen

source: She visited Norway and Sweden in 1929 and delivered designs to Aino and Alvar Aalto's interior design company Artek in Finland.
nb: Hun besøkte Norge og Sverige i 1929 – og leverte design til Aino og Alvar Aaltos innredningsfirma Artek i Finland.

source: Black people were an object of fascination in western European art for a long time.
nb: Svarte mennesker var lenge gjenstand for en fascinasjon i europeisk kunst.

source: House for a Young Woman
nb: Hus for en ung kvinne

source: A transparent technique
nb: En transparent teknikk

source: Vigeland travelled to Paris in 1893 and was inspired by what he saw there, for example when he visited Auguste Rodin’s studio and took in the powerful
nb: Vigeland besøkte Paris i 1893 og mottok der mange kunstneriske impulser. Blant annet besøkte han Auguste Rodins atelier og så hans mektige

source: "Seilbåt ved land" relates to: Related works
nb: "Seilbåt ved land" relaterer til: Utforsk lignende verk fra samlingen

source: Chicago: University of Chicago Press, 1994.
nb: Inghild Karlsen, 1994. Utgitt i forbindelse med São Paulo-biennalen.

source: Restaurant Skansen, elevation fronting the park
nb: Forslag til ominnredning av Restaurant Skansen

source: A total of nine original works is included in the exhibition, including Eventyrstolen (The Fairy Tale Chair) (1898), which originally stood in the Fairy Tale Room at Holmenkollen Tourist Hotel.
nb: Totalt ni originalverk er med i utstillingen, blant annet Eventyrstolen (1898), som opprinnelig sto i Eventyrværelset på Holmenkollen Turisthotell.

source: Children (under and including the age of 18)Schools (grunnskole/videregående skole)Art students with valid student ID (Art, Design, Architecture, Art History, Museology and Conservation)Companion (with companion card)
nb: Barn og unge t.o.m. 18 årSkoleklasser (grunnskole/videregående skole)Kunststudenter med gyldig studentbevis (kunst, design, arkitektur, kunsthistorie, museologi og konservering)MedlemmerLedsager med ledsagerbevis

source: At the core of the programme were Tate staff and Associates
nb: Kjernen i programmet besto av partnere og ansatte ved Tate,

source: Another Norwegian architect, Hans Mollø-Christensen, studied at Bauhaus at the same time as Sandvik.
nb: En annen norsk arkitekt, Hans Mollø-Christensen, studerte ved Bauhaus samtidig med Sandvik.

source: "Kvinne under blomstrende plommetrær" relates to: Related works
nb: "Kvinne under blomstrende plommetrær" relaterer til: Utforsk lignende verk fra samlingen

source: "Figurstudie; skip" relates to:
nb: "Figurstudie (fragment)" relaterer til:

source: "Figur- og dyrestudier" relates to: Related works
nb: "Figur- og dyrestudier i tre rader" relaterer til: Utforsk lignende verk fra samlingen

source: Abraham Waesberge (Publisher - assumed certain)
nb: Abraham Waesberge (Utgiver/forlegger - antatt sikker)

source: "Utsikt over Falkenstein (detalj)" relates to: Related works
nb: "Utsikt over Falkenstein (detalj), Falkensteen" relaterer til: Utforsk lignende verk fra samlingen

source: "Mann liggende i seng" relates to: Related works
nb: "Mann liggende i seng" relaterer til: Utforsk lignende verk fra samlingen

source: In 2009 she was the featured artist at the Dutch Pavilion at the Venice Biennale, where
nb: I 2009 var hun hovedutstiller i den nederlandske paviljongen i Venezia, hvor

source: Peter Paul Rubens (by erroneus tradition)
nb: Peter Paul Rubens (ifølge feilaktig tradisjon)

source: Exhibition catalogue, Oslo: Kunstforeningen, 1971.
nb: Utstillingskatalog, Oslo: Kunstforeningen, 1971.

source: "Seilbåter ved stranden, Ahlbeck" relates to: Related works
nb: "Seilbåter ved stranden, Ahlbeck" relaterer til: Utforsk lignende verk fra samlingen

source: The principle of an "objective", rational, and user-friendly design – "Neue Sachlichkeit", was important at Bauhaus and permeated Lie-Jørgensen's designs.
nb: Prinsipper om en «objektiv», rasjonell, og brukervennlig design – «neue sachlichkeit», stod høyt i Bauhaus og gjennomsyret Lie-Jørgensens design.

source: Now textiles were to be made to suit the new functionalist architecture (Neues Bauen) and industrial prototypes were supplied from Bauhaus on a larger scale.
nb: Nå skulle det lages tekstiler som passet til den nye funksjonalistiske, arkitekturen (Neues Bauen) og protyper for industrien ble levert fra Bauhaus i et større omfang.

source: Tschudi is an art historian and professor at the Oslo School of Architecture and Design, and his book of the same title will be published in 2022.
nb: Tschudi er kunsthistoriker og professor ved Arkitektur- og designhøgskolen i Oslo (AHO), og hans bok med samme tittel utkommer i 2022.

source: – That these trans women felt safe enough to be photographed is a powerful and beautiful thing to see, says Isak Bradley, one of the organisers of
nb: – At disse transkvinnene har følt seg trygge nok til å bli tatt bilder av er sterkt og vakkert å se, sier Isak Bradley, en av arrangørene av

source: "To rastende menn" relates to: Related works
nb: "To rastende menn" relaterer til: Utforsk lignende verk fra samlingen

source: Office building at Fritjof Nansens plass 6
nb: Kontorbygg i Fritjof Nansens plass 6

source: With a design language that drew on both Norwegian wooden house tradition and international postmodernism, the communal rooms were partly glassed-in areas, while the private living units were tailored for each family, built in wood over two levels, with both double height ceilings and split-level floors.
nb: I et formspråk som trakk veksler på både norsk trehustradisjon og internasjonal postmodernisme, var fellesrommene delvis glassdekkete områder, mens de private boenhetene var skreddersydd for hver enkelt familie, bygget i treverk over to plan, med både doble takhøyder og halve etasjer.

source: "Calton Hill, Edinburgh" relates to: Related works
nb: "Calton Hill, Edinburgh" relaterer til: Utforsk lignende verk fra samlingen

source: Show the image "Toiles from Dior, 1957." in fullscreen
nb: Vis bildet "Toiles fra Dior, 1957." i full størrelse

source: Show the image "Melina, 1962.
nb: Vis bildet "Melina, 1962.

source: "Stor flaggermus II" relates to: Related works
nb: "Stor flaggermus II" relaterer til: Utforsk lignende verk fra samlingen

source: "Stor flaggermus III" relates to: Related works
nb: "Stor flaggermus III" relaterer til: Utforsk lignende verk fra samlingen

source: While staying in Paris, the Norwegian artist Erik Werenskiold managed to coax the art dealer Theo van Gogh, the brother of Vincent van Gogh, to send a few French paintings to the Autumn Exhibition in Kristiania.
nb: Under et opphold i Paris fikk Erik Werenskiold overtalt kunsthandleren Theo van Gogh, Vincent van Goghs bror, til å sende noen franske bilder opp til ”Høstutstillingen”.

source: Frans de Neve (assumed certain)
nb: Frans de Neve (antatt sikker)

source: "Loft, Sevle i Numedalen" relates to: Related works
nb: "Loft, Sevle i Numedalen" relaterer til: Utforsk lignende verk fra samlingen

source: (1990) is a monochromatic “painting” where the enigmatic white hue stems not from paint but from frost from a cooling unit.
nb: (1990) er et monokromt «maleri», der den gåtefulle hvitfargen ikke skyldes maling, men frost fra et kjøleelement.

source: Uidentifisert, flamsk (assumed certain)
nb: Uidentifisert fotograf (Fotograf - usikker)

source: In 1995 Abramovic made a series of works with the title
nb: I 1995 skapte Abramovic en serie arbeider under fellestittelen

source: At the age of 87 he created a comprehensive series of prints, “
nb: Da Picasso var 87 år laget han en stor serie grafiske verker som er blitt kalt «Den erotiske suite» eller

source: Born 20.11.1911 in Fredrikstad, death 1988 in Halden
nb: Født 20.11.1911 i Fredrikstad, død 1988 i Halden

source: The picture was a success when shown at the Autumn Exhibition in 1883.
nb: Bildet slo godt an da det ble stilt ut på Høstutstillingen i 1883.

source: "Mannsportrett sett bakfra" relates to: Related works
nb: "Mannsportrett sett bakfra" relaterer til: Utforsk lignende verk fra samlingen

source: Nicolas Beatrizet (by erroneus tradition)
nb: Nicolas Beatrizet (ifølge feilaktig tradisjon)

source: "Fra Klein Zicker" relates to: Related works
nb: "Fra Klein Zicker" relaterer til: Utforsk lignende verk fra samlingen

source: Forms, lines, and colours are repeated and contrast with one another.
nb: Former, linjer og farger gjentas og kontrasterer hverandre.

source: Prince Eugen was a landscape painter, and his paintings often depicted cultural landscapes from the environs of Stockholm, Mälaren, and Skåne.
nb: Prins Eugen var landskapsmaler, og han hentet ofte sine motiver fra kulturlandskapet rundt Stockholm og Mälaren eller fra Skåne.

source: program or policy, compared to a set of
nb: program eller en strategi, satt opp mot et sett med

source: "Mannshode" relates to:
nb: "Mannshode" relaterer til:

source: "Plantestudie ved Hurrungene" relates to: Related works
nb: "Plantestudie ved Hurrungene" relaterer til: Utforsk lignende verk fra samlingen

source: Everyone knew what I was doing.
nb: Alle visste hva jeg gjorde.

source: It was discovered there by museum director H. A. Grosch, who oversaw its purchase in 1887 and brought it to what is now the National Museum.
nb: Her ble det oppdaget av museumsdirektør H. Grosch, som sørget for at teppet ble kjøpt i 1887 og overført til Kunstindustrimuseet.

source: nature of the evaluation allowed staff and Associates to
nb: ved Tate lærte i fase én, for eksempel, var avgjørende for

source: What is referred to as the Nordic cohousing community can be dated to around 1970.
nb: Det man kaller det nordiske bofellesskapet kan tidfestes til rundt 1970.

source: Show the image "Maja Refsum with relief for Oslofjord, 1930's." in fullscreen
nb: Vis bildet "Maja Refsum med relieff til Oslofjord på 1930-tallet." i full størrelse

source: "Fra Gulsvik ved Krøderen" relates to: Related works
nb: "Fra Gulsvik ved Krøderen" relaterer til: Utforsk lignende verk fra samlingen

source: evaluation is critical, although it varies between projects.
nb: er avgjørende, selv om det varierer fra prosjekt til prosjekt.

source: John Savio, «Sommer», probably between 1922 and 1928.
nb: John Savio, «Sommer», ant. mellom 1922 og 1928.

source: Kirstine Roepstorff combines the aesthetic techniques of the avant-garde, such as collage and montage, with the appropriation strategies of the 1980s.
nb: Kirstine Roepstorff bruker avantgardens estetiske teknikker, som collage og montasje, og kombinerer dem med 1980-årenes appropriasjonspraksis.

source: Today, there are cohousing communities all over the world – including in the USA, Canada, England and Australia – all of which recognise their origins in the Nordic countries.
nb: I dag finnes det bofellesskapsforeninger over hele verden – blant annet i USA, Canada, England, Australia – som alle henviser til opphavet i Norden.

source: Qing (Historical event, person, place, with affiliation)
nb: Kangxi (Historisk hendelse, person, sted, med tilknytning)

source: Koefoed continues: "Hertervig became the Norwegian van Gogh.
nb: «Hertervig ble den norske van Gogh.

source: The expressive quality of these paintings is cheerful, sentimental and often humoristic.
nb: Uttrykket i disse maleriene er blidt, sentimentalt, og ofte humoristisk.

source: Berger continued to teach part-time at Bauhaus Dessau school until it was closed down by the Nazis in October 1932.
nb: Berger fortsatte å undervise deltid ved Bauhaus Dessau skolen til den ble stengt av nazistene i oktober 1932.

source: At the end of 2018, the Sudanese people took to the streets again in a national uprising, and after a few months, the protesters took control of a country that had been ruled by the military for 30 years.
nb: På slutten av 2018 tok det sudanske folket til gatene igjen i et nasjonalt opprør, og etter noen måneder tok demonstrantene kontroll over landet som hadde vært styrt av militæret i 30 år.

source: "Fra Sant'Elena, Venezia" relates to: Related works
nb: "Fra Sant'Elena, Venezia" relaterer til: Utforsk lignende verk fra samlingen

source: The Yugoslav Bauhaus weaver and designer Otti Berger (1898–1944 or 45) travelled to Norway in the summer of 1929, when she visited Oslo and Bergen.
nb: Den jugoslaviske Bauhaus-veveren og designeren Otti Berger (1898–1944 eller 45) reiste til Norge sommeren 1929.

source: When his family fell upon harder times, the young Stoltenberg returned home to Norway and earned his living as an itinerant carpenter and portraitist.
nb: Familien slet etter hvert økonomisk, og den unge Stoltenberg reiste tilbake og livnærte seg som omreisende møbelsnekker og portrettmaler i Norge.

source: Wang invites the viewer to lavishly laid tables and extravagant meals.
nb: Wang inviterer til overdådige oppdekninger og måltider.

source: His destination was Passaic, the little town in New Jersey where he had been born.
nb: Reisemålet var Passaic, den lille byen i New Jersey hvor han var født.

source: At the same time, she attended Wassily Kandinsky's lectures in form and design and Paul Klee's course in colour theory.
nb: Samtidig fulgte hun Wassily Kandinskys forelesninger i form og design og Paul Klees timer i fargelære.

source: "Mellom Brennhaugen og Laurgård i Gudbrandsdalen" relates to: Related works
nb: "Mellom Brennhaugen og Laurgård i Gudbrandsdalen, Mellem Brændehagen og Laurgård" relaterer til: Utforsk lignende verk fra samlingen

source: Director Walter Gropius had previously placed all female students in the weaving workshop, based on the idea that "where there is wool, there are women".
nb: Rektor Walter Gropius hadde tidligere plassert alle kvinnelige studenter i vevstuen, med den tanke at «der det er ull, er det kvinner».

source: The material use and construction here typify Løw’s works, and
nb: Hennes materialbruk og konstruksjoner er typiske, og

source: The QR codes are generated with the Animal Crossing Pattern Tool – https://acpatterns.com/
nb: QR-kodene er generert med verktøyet Animal Crossing Pattern Tool – https://acpatterns.com/
